taskt/Core/Automation/Commands/FolderGroup/AFolderCopyMoveFolderCommands_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.AFolderCopyMoveFolderCommands" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.CopyFolderCommand" [ label="CopyFolderCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.AFolderCopyMoveFolderCommands" [ label="AFolderCopyMoveFolderCommands", style="dashed", ];
"taskt.Core.Automation.Commands.MoveFolderCommand" [ label="MoveFolderCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.CopyFolderCommand" -> "taskt.Core.Automation.Commands.AFolderCopyMoveFolderCommands";
"taskt.Core.Automation.Commands.MoveFolderCommand" -> "taskt.Core.Automation.Commands.AFolderCopyMoveFolderCommands";
}
